class subject:

 def Findsubject(code):
    if code == "05506003" or code == "1"or code == "PROGRAMMING FUNDAMENTALS" or code == "การเขียนโปรแกรมขั้นพื้นฐาน":
        answer_function = "PROGRAMMING FUNDAMENTALS: แนวคิดของการเขียนโปรแกรมแบบโพรซีเดอร์เบื้องต้น ประเภทของข้อมูล โครงสร้างการควบคุม ฟังก์ชัน อะเรย์แฟ้ม และกลไกการทำงาน การทดสอบ การหาที่ผิดของโปรแกรม การจัดการข้อผิดพลาด "
    elif code == "05506004"or code == "2"or code == "OBJECT-ORIENTED PROGRAMMING"or code == "การเขียนโปรแกรมเชิงออบเจกต์":
        answer_function = "OBJECT-ORIENTED PROGRAMMING: ทฤษฎีและแนวคิดเรื่องออบเจกต์ คลาส ประเภทข้อมูลนามธรรม รูปแบบความสัมพันธ์ของออบ เจกต์ การสืบทอดคุณสมบัติ การห่อหุ้มและการซ่อนสารสนเทศ โพลีมอร์ฟิซึม การสร้างแบบจำลองเชิงวัตถุ ของระบบ การเขียนโปรแกรมด้วยภาษาเชิงออบเจกต์ที่ได้รับความนิยม"
    elif code == "05506005"or code == "3"or code == "COMPUTER SCIENCE"or code == "วิทยาการคอมพิวเตอร์":
        answer_function = "COMPUTER SCIENCE: การจัดองค์ประกอบและสถาปัตยกรรมคอมพิวเตอร์เบื้องต้น การสื่อสารข้อมูลและเครือข่าย เบื้องต้น การคิดเชิงตรรกะการแทนค่าข้อมูล การแปลภาษาของคอมพิวเตอร์ หลักการออกแบบโปรแกรม ภาษาเชิงกระบวนคำสั่ง ตัวแปร ชนิดข้อมูลนิพจน์ แนวคิดการเขียนโปรแกรม โครงสร้างควบคุม การ ส่งผ่านพารามิเตอร์ โครงสร้างและการประมวลผลแฟ้มข้อมูลแบบต่างๆ วิธีการคำนวณโดยใช้เครื่อง คอมพิวเตอร์ เขียนและทดสอบโปรแกรมด้วยภาษาซี หรือภาษาระดับสูงกว่า"
    elif code == "05506006"or code == "4"or code == "DATA STRUCTURES AND ALGORITHMS"or code == "โครงสร้างข้อมูลและขั้นตอนวิธี":
        answer_function = "DATA STRUCTURES AND ALGORITHMS: แนวคิดของโครงสร้างข้อมูลและขั้นตอนวิธีเบื้องต้น โครงสร้างข้อมูลเบื้องต้น ได้แก่ กองซ้อน คิวลิงค์ลิสต์ ตารางแฮช ต้นไม้และกราฟ การเรียกซ้ำ เทคนิคการค้นและเทคนิคการเรียงลำดับ การวิเคราะห์ขั้นตอนวิธีขั้น พื้นฐาน"
    elif code == "05506007"or code == "5"or code == "OPERATING SYSTEMS"or code == "ระบบปฏิบัติการ":
        answer_function = " OPERATING SYSTEMS: หน้าที่ของระบบปฏิบัติการ องค์ประกอบของระบบปฏิบัติการ การจัดการโปรเซส การแก้ปัญหา การติดตาย การจัดการหน่วยความจำ การจัดการตัวประมวลผล การจัดการอุปกรณ์รับและแสดงผล การจัดการ หน่วยเก็บข้อมูล เครือข่ายและระบบกระจายเบื้องต้น"
    elif code == "05506008"or code == "6"or code == "COMPUTER ORGANIZATION AND ARCHITECTURE"or code == "โครงสร้างและสถาปัตยกรรมคอมพิวเตอร์":
        answer_function = "COMPUTER ORGANIZATION AND ARCHITECTURE: แนวคิดของการจัดองค์ประกอบและสถาปัตยกรรมระบบคอมพิวเตอร์ วงจรตรรกะดิจิทัล การนำเสนอ ข้อมูลในระดับเครื่อง แอสเซมบลีระดับเครื่อง ระบบหน่วยความจำ การเชื่อมต่อและการติดต่อภายในระบบ คอมพิวเตอร์ การจัดองค์กรเชิงฟังก์ชัน"
    elif code == "05506009"or code == "7"or code == "ANALYSIS AND DESIGN OF ALGORITHMS"or code == "การวิเคราะห์และการออกแบบขั้นตอนวิธี":
        answer_function = "ANALYSIS AND DESIGN OF ALGORITHMS: แนวคิดของวิธีการเชิงรูปนัยที่สนับสนุนการออกแบบและการวิเคราะห์ขั้นตอนวิธี โดยเน้นทั้งภาค ทฤษฎีและภาคปฏิบัติที่มีประสิทธิภาพ การจำกัดเขตความซับซ้อนแบบอะซิมพ์ทอติก เทคนิคการวิเคราะห์"
    elif code == "05506011"or code == "8"or code == "HUMAN-COMPUTER INTERACTION"or code == "ปฏิสัมพันธ์ระหว่างมนุษย์และคอมพิวเตอร์":
        answer_function = "HUMAN-COMPUTER INTERACTION: ความรู้เบื้องต้นเกี่ยวกับปฏิสัมพันธ์ระหว่างมนุษย์และคอมพิวเตอร์ ความสามารถของประสาท สัมผัสของมนุษย์ ระบบติดต่อกับผู้ใช้แบบกราฟิกส์ การพัฒนาระบบโต้ตอบ การออกแบบส่วนปฏิสัมพันธ์"
    elif code == "05506012"or code == "9"or code == "DATABASE SYSTEMS"or code == "ระบบฐานข้อมูล":
        answer_function = "DATABASE SYSTEMS: แนวคิดฐานข้อมูล โมเดลเอนติตีและรีเลชันชิพ โมเดลเชิงสัมพันธ์ พีชคณิตเชิงสัมพันธ์และภาษา เอสคิวแอล ทฤษฎีการนอร์มอไลเซชัน ความปลอดภัยฐานข้อมูล บูรณภาพของข้อมูลและรายการเปลี่ยนแปลง และพื้นฐานการพัฒนาโปรแกรมประยุกต์บนฐานข้อมูล"
    elif code == "05506013"or code == "10"or code == "INFORMATION MANAGEMENT"or code == "การจัดการสารสนเทศ":
        answer_function = "INFORMATION MANAGEMENT: ทฤษฎีและแนวคิดระบบ ระบบสารสนเทศและระบบองค์กร ระบบสนับสนุนการตัดสินใจ คุณภาพ ระบบระดับต่างๆ ได้แก่ กลยุทธ์ แทกติก และการดำเนินการ ส่วนประกอบของระบบและความสัมพันธ์ กลยุทธ์ ระบบสารสนเทศ"
    elif code == "05506014"or code == "11"or code == "COMPUTER GRAPHICS"or code == "คอมพิวเตอร์กราฟิกส์ ":
        answer_function = "COMPUTER GRAPHICS: ระบบกราฟิกส์ การทำงานของอุปกรณ์อินพุตและเอาท์พุตที่ใช้ในคอมพิวเตอร์กราฟิกส์ อัลกอริทึ่ม สำหรับการวาดเส้น วงกลม วงรี การสร้างเส้นโค้งด้วยอัลกอริทึ่ม บี-สไปลน์ คิวบิก-สไปล์และเบอซิเออร์ อัลกอริทึ่ม สำหรับการเติมพื้นที่ สแกนไลน์ ซีดฟิลด์ สีเทาและสี การแปลงวัตถุ 2 มิติ และ 3 มิติ เน้นการสร้างภาพ กราฟิกส์ด้วยการ เขียนโปรแกรมภาษาซีและจาวา"
    elif code == "05506015"or code == "12"or code == "COMPUTER ETHICS: SOCIAL AND PROFESSIONAL ISSUES"or code == "จรรยาบรรณทางวิชาชีพและเชิงสังคม":
        answer_function = "COMPUTER ETHICS: SOCIAL AND PROFESSIONAL ISSUES: บริบททางสังคมของระบบคอมพิวเตอร์ จริยธรรมทางคอมพิวเตอร์ วิธีการในการวิเคราะห์ ความ รับผิดชอบและจรรยาบรรณทางด้านวิชาชีพ การดำเนินการทางด้านความปลอดภัย ความเสี่ยง ทรัพย์สินทาง ปัญญา การละเมิดสิทธิส่วนบุคคล อาชญากรรมทางคอมพิวเตอร์ กรณีศึกษา"
    elif code == "05506016"or code == "13"or code == "DATA COMMUNICATION AND NETWORK SYSTEMS"or code == "การสื่อสารข้อมูลและระบบเครือข่าย":
        answer_function = "DATA COMMUNICATION AND NETWORK SYSTEMS: ระบบการตรวจสอบและป้องกันข้อผิดพลาดของสัญญาณ สภาพแวดล้อมการสื่อสารและกฎเกณฑ์ที่เกี่ยวข้องกับการออกแบบและการใช้ระบบสื่อสารข้อมูล การบีบอัด ข้อมูล หน้าที่ของระบบเครือข่ายคอมพิวเตอร์คุณลักษณะทั่วไปและคุณลักษณะเฉพาะ โทโปโลยี่ของเครือข่าย โปรโตคอลของเครือข่าย เช่น TCP/IP, NETBEUI, IPX/SPX สถาปัตยกรรมของเครือข่าย การเชื่อมต่อเครือข่าย"
    elif code == "05506017"or code == "14"or code == "SOFTWARE ENGINEERING"or code == "วิศวกรรมซอฟต์แวร์":
        answer_function = "SOFTWARE ENGINEERING: กระบวนการซอฟต์แวร์ การจัดการโครงการ การวิเคราะห์ความต้องการ สถาปัตยกรรมซอฟต์แวร์ การออกแบบรายละเอียด การสร้างหน่วยซอฟต์แวร์และการทดสอบ การบูรณะการระบบ การตรวจสอบ และ การสอบทาน การประกันคุณภาพซอฟต์แวร์ การบำรุงรักษาซอฟต์แวร์"
    elif code == "05506018"or code == "15"or code == "SEMINAR"or code == "สัมมนา ":
        answer_function = "SEMINAR: การนำเสนอรายงานการค้นคว้าของนักศึกษาในหัวข้อที่นักศึกษาสนใจ และได้รับความเห็นชอบ จากอาจารย์ที่ปรึกษา โดยเสริมแนวทางการประกอบอาชีพ และจริยธรรมในวิชาชีพ"
    elif code == "05506113"or code == "16"or code == "SOFTWARE ANALYSIS AND DESIGN"or code == "การวิเคราะห์และออกแบบซอฟต์แวร์":
        answer_function = "SOFTWARE ANALYSIS AND DESIGN: วงจรชีวิตของซอฟต์แวร์ เทคนิคและเครื่องมือในการวิเคราะห์และออกแบบ แบบโครงสร้าง การ จัดทำแบบจำลองระบบ การจัดทำต้นแบบระบบ การออกแบบส่วนติดต่อผู้ใช้ การออกแบบฐานข้อมูล การ ออกแบบเครือข่าย คัปปลิง โคฮีชัน มอร์โฟโลยีและแนวทางการออกแบบอื่น รวมถึงการออกแบบและการ จัดการโครงงานซอฟต์แวร"
    elif code == "05506200"or code == "17"or code == "INTRODUCTION TO SUPPLY CHAIN MANAGEMENT AND FINANCIAL ANALYSIS"or code == "การจัดการห่วงโซ่อุปทานและวิเคราะห์การเงินเบื้องต้น":
        answer_function = "INTRODUCTION TO SUPPLY CHAIN MANAGEMENT AND FINANCIAL ANALYSIS: ลักษณะของธุรกิจสภาพแวดล้อมและรูปแบบความเป็นเจ้าของธุรกิจ การบริหารธุรกิจกิจกรรม ทางธุรกิจด้านการผลิตการตลาดการเงินการบัญชีการบริหารสารสนเทศ และการบริหารทรัพยากรมนุษย์ทั้งนี้ เพื่อปูพื้นฐานแนวความคิดของการบริหารธุรกิจ และให้เกิดความคิดรวบยอดผ่านการจัดทำแผนธุรกิจ "
    elif code == "05506209"or code == "18"or code == "AUTOMATA THEORY AND PROGRAMMING LANGUAGES"or code == "ทฤษฎีออโตมาตาและภาษาโปรแกรม":
        answer_function = "AUTOMATA THEORY AND PROGRAMMING LANGUAGES: ออโตมาตาสถานะจำกัด นิพจน์ปกติ ไวยากรณ์ปกติ ออโตมาตากดลง ภาษาและไวยากรณ์ ไม่อิง บริบท เครื่องทัวริงและเครื่องที่ดัดแปลงจากเครื่องทัวริง ปัญหาที่ตัดสินไม่ได้ ทฤษฎีคอมไพเลอร์เบื้องต้น"
    elif code == "05506210"or code == "19"or code == "ARTIFICIAL INTELLIGENCE"or code == "ปัญญาประดิษฐ์":
        answer_function = "ARTIFICIAL INTELLIGENCE: พื้นฐานระบบอัจฉริยะ การแก้ปัญหาและปริภูมิสถานะ การค้นหาปริภูมิสถานะด้วยการค้นหาแบบ บอด การค้นหาแบบฮิวริสติก การเล่นเกม การแทนความรู้ ระบบผู้เชี่ยวชาญ ตรรกศาสตร์คลุมเครือ การเรียนรู้ ของเครื่อง ได้แก่ ขั้นตอนวิธีเชิงพันธุกรรม ต้นไม้ตัดสินใจ โครงข่ายประสาทเทียม"
    else: answer_function="ไม่พบวิชา"

    #answer_function = "ฟังก์ชันดิสครีต ภาวะเชิงการนับและการนับได้ ตรรกศาสตร์เชิงประพจน์และตรรกศาสตร์ภาคแสดงทฤษฎีเวียนบังเกิด กราฟและต้นไม้ คณิตศาสตร์เชิงการจัดและความน่าจะเป็นแบบไม่ต่อเนื่อง โมเดลทางการคำนวณเบื้องต้น"
    return answer_function 

   